window.addEventListener("load", () => {
  // amazing chinese characters api--http://ccdb.hemiola.com/
  const chars = [
    "丁","丂","七","丄","丅","丆","丩","丷","乂","乃","乄","乜","九","了","二","亠","人","亻","儿","入","八","冂","冖","冫","几","凵","刀","刁","刂","力","勹","匕","匚","匸","十","卜","卩","厂","厶","又","巜","讠","万","丈","三","上","下","丌","个","丫","丸","久","乆","乇","么","义","乊","乞","也","习","乡","亇","亍","于","亏","亐","亡","亼","亽","亾","亿","兀","兦","凡","凢","凣","刃","刄","劜","勺","卂","千","卄","卪","卫","叉","口","囗","土","士","夂","夊","夕","大","夨","女","子","孑","孒","孓","宀","寸","小","尢","尣","尸","屮","山","巛","川","工","己","已","巳","巾","干","幺","广","廴","廾","弋","弓","彐","彑","彡","彳","忄","扌","才","氵","犭","纟","艹","门","阝","飞","饣","马","不","与","丏","丐","丑","丒","专","丗","丬","中","丮","丯","丰","丹","为","之","乌","乢","乣","乤","乥","书","予","云","互","亓","五","井","亖","亢","亣","什","仁","仂","仃","仄","仅","仆","仇","仈","仉","今","介","仌","仍","从","仏","仐","仑","仒","仓","允","兂","元","內","公","六","兮","兯","冃","冄","内","円","冇","冈","冗","冘","凤","凶","刅","分","切","刈","劝","办","勻","勼","勽","勾","勿","匀","匁","匂","化","匹","区","卅","卆","升","午","卝","卞","卬","厃","厄","厅","历","厷","厸","厹","及","友","双","反","収","圠","圡","壬","夃","天","太","夫","夬","夭","孔","尐","少","尤","尹","尺","屯","屲","巴","巿","帀","币","幻","廿","开","弌","弔","引","弖","心","必","忆","戈","戶","户","戸","手","扎","支","攴","攵","文","斗","斤","方","无","日","曰","月","木","朩","欠","止","歹","殳","毋","毌","比","毛","氏","气","水","火","灬","爪","爫","父","爻","爿","片","牙","牛","牜","犬","犮","王","礻","罓","耂","肀","见","计","订","讣","认","讥","贝","车","辶","闩","韦","风","且","丕","世","丘","丙","业","丛","东","丝","丱","主","丼","乍","乎","乏","乐","乧","亗","仔","仕","他","仗","付","仙","仚","仛","仜","仝","仞","仟","仠","仡","仢","代","令","以","仦","仧","仨","仩","仪","仫","们","仭","兄","充","兰","冉","冊","冋","册","写","冚","冬","冭","冮","冯","凥","処","凧","凷","凸","凹","出","击","刉","刊","刋","刌","刍","功","加","务","劢","匃","匄","包","匆","匇","北","匛","匜","匝","匞","卉","半","卌","卟","占","卡","卢","卭","卮","卯","厇","厈","厉","厺","去","厼","叏","叐","发","古","句","另","叧","叨","叩","只","叫","召","叭","叮","可","台","叱","史","右","叴","叵","叶","号","司","叹","叺","叻","叼","叽","叾","囘","囙","囚","四","囜","圢","圣","圤","圥","圦","圧","壭","处","外","夗","夘","央","夯","夰","失","夲","夳","头","奴","奵","奶","孕","宁","宂","它","宄","对","尒","尓","尔","尕","尻","尼","屳","屴","屵","屶","屷","左","巧","巨","市","布","帄","帅","平","幼","庀","庁","庂","広","弁","弍","弗","弘","归","忇","忉","忊","戉","戊","戋","戹","扐","扑","扒","打","扔","払","扖","斥","旡","旦","旧","曱","未","末","本","札","朮","术","朰","正","歺","母","氐","民","氕","氶","氷","永","氹","氺","氻","氾","氿","汀","汁","汃","汄","汅","汇","汈","汉","灭","犯","犰","玄","玉","玊","玌","玍","瓜","瓦","甘","生","用","甩","田","由","甲","申","甴","电","疋","疒","癶","白","皮","皿","目","矛","矢","石","示","禸","禾","穴","立","纠","罒","肊","衤","讦","讧","讨","让","讪","讫","讬","训","议","讯","记","讱","轧","辷","邒","邓","钅","长","闪","阞","队","饤","饥","驭","鸟","龙"
  ];
  const phElem = document.getElementById("phrase");

  function getRandomInt(min, max) {
    min = Math.ceil(min);
    max = Math.floor(max);
    return Math.floor(Math.random() * (max - min) + min); // The maximum is exclusive and the minimum is inclusive
  }

  // async function getChars() {
  //   for (let i = 2; i < 6; i++) {
  //     await fetch(`http://ccdb.hemiola.com/characters/strokes/${i}`).then((r) => r.json()).then((d) => {
  //       d.forEach((c) => chars.push(c.string));
  //     })
  //   }
  // }
  // getChars.then(() => console.log(chars));

  function makePhrase() {
    if (!chars) return;
    phElem.innerHTML = "";
    for (let i = 0; i < 4; i++) {
      let x = chars[getRandomInt(0, chars.length)];
      phElem.innerHTML = phElem.innerText.includes(x) ? i-=1 : phElem.innerHTML + x;
    }
  }
  
  makePhrase();
  phElem.addEventListener('click', makePhrase);
});